// 농사로 품종 코드
export const variety_code = {
  '063001': '가지과',
  '063002': '고란초과',
  '063003': '고비과',
  '063004': '고사리과',
  '063005': '국화과',
  '063006': '괭이밥과',
  '063007': '꼭두서니과',
  '063008': '꿀풀과',
  '063009': '나한송과',
  '063010': '난초과',
  '063011': '노박덩굴과',
  '063012': '닭의장풀과',
  '063013': '대극과',
  '063014': '도금양과',
  '063015': '돈나무과',
  '063016': '돌나물과',
  '063017': '두릅나무과',
  '063018': '마디풀과',
  '063019': '마란타과',
  '063020': '마편초과',
  '063021': '매자나무과',
  '063022': '면마과',
  '063023': '물밤나무과',
  '063024': '물푸레나무과',
  '063025': '박주가리과',
  '063026': '봉선화과',
  '063028': '범의귀과',
  '063029': '베고니아과',
  '063031': '바늘꽃과',
  '063033': '백합과',
  '063034': '범위귀과',
  '063036': '부처손과',
  '063037': '분꽃과',
  '063038': '뽕나무과',
  '063039': '사초과',
  '063040': '생강과',
  '063041': '소철과',
  '063042': '수선화과',
  '063043': '쐐기풀과',
  '063044': '아라우카리아과',
  '063045': '앵초과',
  '063046': '인동과',
  '063047': '자금우과',
  '063048': '장미과',
  '063049': '쥐꼬리망초과',
  '063050': '쥐손이풀과',
  '063051': '진달래과',
  '063052': '차나무과',
  '063053': '천남성과',
  '063054': '측백나무과',
  '063055': '층층나무과',
  '063056': '파인애플과',
  '063057': '포도과',
  '063058': '협죽도과',
  '063059': '후추과',
  '063060': '야자과',
  '063061': '미나리아재비과',
  '063062': '용설란과',
  '063063': '운향과',
  '063064': '은방울꽃과',
  '063067': '제비꽃과',
  '063068': '제스네리아과',
  '063069': '줄고사리과',
  '063071': '쥐손풀이과',
  '063072': '지치과',
  '063076': '초롱꽃과',
  '063079': '콜치카세아과',
  '063080': '콩과',
  '063082': '파초과',
  '063083': '판다누스과',
  '063085': '한련과',
  '063086': '현삼과',
  '063088': '회양목과',
  '063090': '히야신스과',
};

// 냄새
export const smellCode = {
  '079001': '강함',
  '079002': '중간',
  '079003': '약함',
  '079004': '거의 없음',
};

// 관리수준
export const managelevelCode = {
  '089001': '초보자',
  '089002': '경험자',
  '089003': '전문가',
};

// 생장속도
export const grwtveCode = {
  '090001': '빠름',
  '090002': '보통',
  '090003': '느림',
};

// 생육 온도
export const grwhTpCode = {
  '082001': '10~15℃',
  '082002': '16~20℃',
  '082003': '21~25℃',
  '082004': '26~30℃',
};

// 겨울 최저 온도
export const winterLwetTpCode = {
  '057001': '0℃ 이하',
  '057002': '5℃',
  '057003': '7℃',
  '057004': '10℃',
  '057005': '13℃ 이상',
};

// 습도
export const hdCode = {
  '083001': '40% 미만',
  '083002': '40 ~ 70%',
  '083003': '70% 이상',
};

// 물주기
export const wateringCode = {
  '053001': '항상 흙을 축축하게 유지함(물에 잠김)',
  '053002': '흙을 촉촉하게 유지함(물에 잠기지 않도록 주의)',
  '053003': '토양 표면이 말랐을때 충분히 관수함',
  '053004': '화분 흙 대부분 말랐을때 충분히 관수함',
};

// 분류
export const dCode = {
  '072001': '잎보기식물',
  '072002': '잎&꽃보기식물',
  '072003': '꽃보기식물',
  '072004': '열매보기식물',
  '072005': '선인장다육식물',
};

// 생육형태
export const grwhstleCode = {
  '054001': '직립형',
  '054002': '관목형',
  '054003': '덩굴성',
  '054004': '풀모양',
  '054005': '로제트형',
  '054006': '다육형',
};

// 실내정원
export const indoorpsncpacompositionCode = {
  '085001': '상층목',
  '085002': '중층목',
  '085003': '하층목',
  '085004': '지피식물',
};

// 생태 코드
export const eclgyCode = {
  '086001': '일반형',
  '086002': '건조형',
  '086003': '수경형',
};

// 잎무늬
export const lefmrkCode = {
  '070001': '줄무늬',
  '070002': '점무늬',
  '070003': '잎 가장자리 무늬',
  '070004': '기타 (무늬없음 등)',
};

// 잎색
export const lefcolrCode = {
  '069001': '녹색, 연두색',
  '069002': '금색, 노란색',
  '069003': '흰색, 크림색',
  '069004': '은색, 회색',
  '069005': '빨강, 분홍, 자주색',
  '069006': '여러색 혼합',
  '069007': '기타',
};

// 발화 계절
export const ignSeasonCode = {
  '073001': '봄',
  '073002': '여름',
  '073003': '가을',
  '073004': '겨울',
};

// 꽃색
export const flclrCode = {
  '071001': '파랑색',
  '071002': '보라색',
  '071003': '분홍색',
  '071004': '빨강색',
  '071005': '오렌지색',
  '071006': '노랑색',
  '071007': '흰색',
  '071008': '혼합색',
  '071009': '기타',
};

// 과일 계절
export const fmldeSeasonCode = {
  '087001': '봄',
  '087002': '여름',
  '087003': '가을',
  '087004': '겨울',
};

// 과일색
export const fmldecolrCode = {
  '081001': '파랑색',
  '081002': '보라색',
  '081003': '검정색',
  '081004': '빨강색',
  '081005': '오렌지색',
  '081006': '노랑색',
  '081007': '흰색',
  '081008': '혼합색',
  '081009': '기타',
};

// 번식방법
export const prpgtmthCode = {
  '060001': '파종',
  '060002': '삽목',
  '060003': '분주',
  '060004': '접목',
  '060005': '취목',
  '060006': '기타',
};

// 광요구도
export const lighttdemanddoCode = {
  '055001': '낮은 광도(300~800 Lux)',
  '055002': '중간 광도(800~1,500 Lux)',
  '055003': '높은 광도(1,500~10,000 Lux)',
};

// 배치장소
export const postngplaceCode = {
  '064001': '실내 어두운 곳 (실내깊이 500 이상cm)',
  '064002': '거실 내측 (실내깊이 300~500cm)',
  '064003': '거실 창측 (실내깊이 150~300cm)',
  '064004': '발코니 내측 (실내깊이 50~150cm)',
  '064005': '발코니 창측 (실내깊이 0~50cm)',
  '064006': '습한 곳',
  '064007': '넓은 곳',
  '064008': '좁은 곳',
};
